//----------------------------------------------------------
//This Source Code Form is subject to the terms of the 
//Mozilla Public License, v.2.0. If a copy of the MPL 
//was not distributed with this file, You can obtain one 
//at http://mozilla.org/MPL/2.0/.
//----------------------------------------------------------
Перем юТест;

////////////////////////////////////////////////////////////////////
// Программный интерфейс

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;

	ВсеТесты.Добавить("ТестДолжен_СоздатьПрофиль");

	Возврат ВсеТесты;
	
КонецФункции

Процедура ТестДолжен_СоздатьПрофиль() Экспорт

	Перем Профиль;

	Профиль = Новый ИнтернетПочтовыйПрофиль;

	Профиль.Пользователь = "Пользователь";
	юТест.ПроверитьРавенство(Профиль.Пользователь, "Пользователь");

	Профиль.Пароль = "Пароль";
	юТест.ПроверитьРавенство(Профиль.Пароль, "Пароль");

КонецПроцедуры
