Перем юТест;

////////////////////////////////////////////////////////////////////
// Программный интерфейс

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;

	ВсеТесты.Добавить("ТестДолжен_СоздатьПрофиль");

	Возврат ВсеТесты;
	
КонецФункции

Процедура ТестДолжен_СоздатьПрофиль() Экспорт

	Перем Профиль;

	Профиль = Новый ИнтернетПочтовыйПрофиль;

	Профиль.Пользователь = "Пользователь";
	юТест.ПроверитьРавенство(Профиль.Пользователь, "Пользователь");

	Профиль.Пароль = "Пароль";
	юТест.ПроверитьРавенство(Профиль.Пароль, "Пароль");

КонецПроцедуры
